week_4/quiz_4.tex
% Created 2024-07-15 Mon 12:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\date{}
\title{Graded Quiz 4}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Graded Quiz 4},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:orgc9e45fd}

\textbf{Answer:} Each gas station has an incentive to undercut the high price to steal
customers from their opponent.
\section*{Problem 2}
\label{sec:org6330832}

\textbf{Answer:} The contract specifies a sufficiently large penalty when a gas station
deviates from the high price specified in the contract.
\section*{Problem 3}
\label{sec:orgd28d2b1}

\textbf{Answer:} By deviating from the high price, a gas station can gain some profit
today, but its future profits may decrease.
\section*{Problem 4}
\label{sec:org662b3ba}

\textbf{Answer:}
\begin{itemize}
\item Version 1: Once the restaurant cheats a customer, it will be known through
rumors or through messages posted on the Internet sites. Then, other customers
stop coming to the restaurant.
\item Version 2: Charge price = \$2 for as long as no one has deviated. If anyone
deviates, then charge \$1 forever.
\end{itemize}
\section*{Problem 5}
\label{sec:org554e8e4}

\textbf{Answer:} We say that we can ``make society better'' if we can increase at least
one player's payoff without decreasing any other players' payoffs. An outcome is
efficient if it is no longer possible to make society better in that sense.
\section*{Problem 6}
\label{sec:org1d532c7}

\textbf{Answer:} Clean up the living room, if nobody has ever failed to do so. If
anyone ever fails to clean up the room, then you will never do so.
\section*{Problem 7}
\label{sec:orgeef1d5a}

\textbf{Answer:} \(3+d+d^2+d^3+\cdots\)
\end{document}
